UTAF_Base/requestFiles/BPS_PaymentMethod_SetPaymentMethod.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v2.paymentmethod.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>BPS</urn:consumerApplicationId>
         <urn:endUserId>id867940</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataSetPaymentMethod version="2.0">
         <urn1:userContext>
            <urn2:applicationNm>BPS</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id867940</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <!--You have a CHOICE of the next 2 items at this level-->
         <urn1:customerId>${Req_customerId}</urn1:customerId>
         <urn1:paymentAgreementId>${Req_paymentAgreementId}</urn1:paymentAgreementId>
         <urn1:accountId>${Req_accountId}</urn1:accountId>
         <urn1:collectCode>${Req_collectCode}</urn1:collectCode>
         <urn1:iban>${Req_iban}</urn1:iban>
         <urn1:bic>${Req_bic}</urn1:bic>
         <urn1:umr>${Req_umr}</urn1:umr>
         <urn1:signatureDate>${Req_signatureDate}</urn1:signatureDate>
         <urn1:aliasOgone>${Req_aliasOgone}</urn1:aliasOgone>
         <urn1:brand>${Req_brand}</urn1:brand>
         <urn1:uniqueInd>${Req_uniqueInd}</urn1:uniqueInd>
      </urn1:RequestDataSetPaymentMethod>
   </soapenv:Body>
</soapenv:Envelope>
